calm water resistance/KCS/Fr0.2599/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-14.607297276041855 0 -8.055494821346612)
	(21.91094591406278 0 -8.055494821346612)
	(21.91094591406278 9.129560797526159 -8.055494821346612)
	(-14.607297276041855 9.129560797526159 -8.055494821346612)
	(-14.607297276041855 0 3.7592309166284186)
	(21.91094591406278 0 3.7592309166284186)
	(21.91094591406278 9.129560797526159 3.7592309166284186)
	(-14.607297276041855 9.129560797526159 3.7592309166284186)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (136 34 44) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

